import type { AbstractBook } from "../types";
import * as authors from "./authors";
import * as publishers from "./publishers";
import * as categories from "./categories";

/* eslint-disable max-len */
export const FIGHT_CLUB_2014: AbstractBook = {
    id: 8,
    name: "Бойцовский клуб",
    description: `Чак Паланик живет и Портленде, штат Орегон. Перу его принадлежат четыре романа. Перед нами — дебют Паланика в литературе. «Бойцовский клуб», Своеобразный манифест «сердитых молодых людей» нашего времени...

    Это — самая потрясающая и самая скандальная книга 1990-х.
    
    Книга, в которой устами Чака Паланика заговорило не просто «поколение икс», но — «поколение икс» уже озлобленное, уже растерявшее свои последние иллюзии.
    
    Вы смотрели фильм «Бойцовский клуб»?
    
    Тогда — читайте книгу, по которой он был снят!`,
    authors: [authors.PALAHNIUK],
    publicationYear: 2014,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const FIGHT_CLUB_2018: AbstractBook = {
    id: 32,
    name: "Бойцовский клуб",
    description: `Чак Паланик – современный американский писатель, прославившийся в первую очередь романом "Бойцовский клуб". Но и другие произведения Паланика – "Уцелевший", "Колыбельная", "Призраки" – получали множество наград, некоторые их них экранизировались и неизменно пользовались успехом. У Паланика свой, особенный стиль. Короткие броские фразы, яркие запоминающиеся образы, едкая сатира, черный юмор.

    "Бойцовский клуб" – самый знаменитый роман Чака Паланика. Все помнят фильм режиссера Дэвида Финчера с Брэдом Питтом в главной роли? Он именно по этой книге. Это роман-вызов, роман, созданный всем назло и вопреки всему, в нем описывается поколение озлобившихся людей, потерявших представление о том, что можно и чего нельзя, где добро и зло, кто они сами и кто их окружает. Сам Паланик называет свой "Бойцовский клуб" новым "Великим Гэтсби". Какие же они – эти Гэтсби конца XX века?`,
    authors: [authors.PALAHNIUK],
    publicationYear: 2018,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const BLACK_SWAN_2021: AbstractBook = {
    id: 3,
    name: "Черный лебедь",
    description: `За одно только последнее десятилетие человечество пережило ряд тяжелейших катастроф, потрясений и катаклизмов, не укладывающихся в рамки самых фантастических предсказаний. Выпускник Сорбонны и нью-йоркский финансовый гуру Нассим Талеб называет такие непрогнозируемые события Черными лебедями. Он убежден: именно они дают толчок как истории в целом, так и существованию каждого отдельного человека. И чтобы преуспеть, надо быть к ним готовыми. Сразу после выхода “Черного лебедя” автор блестяще продемонстрировал свою “не-теорию” на практике: на фоне финансового кризиса компания Талеба заработала (а не потеряла!) для инвесторов полмиллиарда долларов. Но его труд — не учебник по экономике. Это размышления незаурядного человека о жизни и о том, как найти в ней свое место.

    В написанном позже эссе-постскриптуме “О секретах устойчивости” Талеб дает остроумный отпор тем экономистам-ортодоксам, которые приняли созданное им антиучение в штыки.
    
    Вошедшее в книгу собрание афоризмов Нассима Талеба — это блестящая квинтэссенция его оригинальных идей.`,
    authors: [authors.TALEB],
    publicationYear: 2021,
    publishingHouse: publishers.COLIBRI,
    category: categories.BUSINESS,
};

export const CHOKE_2006: AbstractBook = {
    id: 24,
    name: "Удушье",

    description: `Книга о молодом мошеннике, который каждодневно разыгрывает в дорогих ресторанах приступы удушья - и зарабатывает на этом неплохие деньги...
    Книга о сексоголиках, алкоголиках и шмоткаголиках. О любви, дружбе и философии. О сомнительном "втором пришествии" - и несомненной "невыносимой легкости бытия" наших дней.
    Впрочем... сам Паланик говорит о ней: "Собираетесь прочесть? Зря!"
    Короче - читайте на свой страх и риск!`,
    authors: [authors.PALAHNIUK],
    publicationYear: 2006,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const CHOKE_2015: AbstractBook = {
    id: 5,
    name: "Удушье",
    description: `Книга о молодом мошеннике, который каждодневно разыгрывает в дорогих ресторанах приступы удушья - и зарабатывает на этом неплохие деньги… Книга о сексоголиках, алкоголиках и шмоткаголиках. О любви, дружбе и философии. О сомнительном "втором пришествии" - и несомненной "невыносимой легкости бытия" наших дней. Впрочем… сам Паланик говорит о ней: "Собираетесь прочесть? Зря!"
    Короче - читайте на свой страх и риск!`,
    authors: [authors.PALAHNIUK],
    publicationYear: 2015,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const WAR_PIECE_2000: AbstractBook = {
    id: 6,
    name: "Война и мир. Том I-II",
    description: `"Война и мир" - самый известный роман Л.Н.Толстого, как никакое другое произведение писателя, отражает глубину его мироощущения и философии. Эта книга из разряда вечных, потому что она обо всем - о жизни и смерти, о любви и чести, о мужестве и героизме, о славе и подвиге, о войне и мире.
    Комментарий
    "Война и мир" - самый известный роман Л.Н.Толстого, как никакое другое произведение писателя, отражает глубину его мироощущения и философии. Эта книга из разряда вечных, потому что она обо всем - о жизни и смерти, о любви и чести, о мужестве и героизме, о славе и подвиге, о войне и мире.`,
    authors: [authors.TOLSTOY],
    publicationYear: 2000,
    publishingHouse: publishers.EKSMO,
    category: categories.IMAGINATIVE,
};

export const WAR_PIECE_1945: AbstractBook = {
    id: 30,
    name: "Война и мир",
    description: `Ленинград, 1945 год. Государственное издательство художественной литературы СССР.
    Издательский переплет. Сохранность хорошая.
    
    Роман Льва Толстого "Война и мир" лежит в основании величественного здания русской классической литературы. С непревзойденным мастерством Толстой воссоздал великую духом Россию - образы этой "книги на все времена" и сейчас пленяют свежестью чувств и щедростью души, искренностью страстей, силой и чистотой убеждений.
    Комментарий
    Формат 210 х 260 мм.`,
    authors: [authors.TOLSTOY],
    publicationYear: 1945,
    publishingHouse: publishers.GOS_PUB,
    category: categories.IMAGINATIVE,
};

export const WAR_PIECE_2009: AbstractBook = {
    id: 1,
    name: "Война и мир. Книга 2",
    description: `Великий роман-эпопея Льва Толстого чудесным образом, как огромная мозаика, сложен из тысяч картин - батальных, бальных, любовных, бытовых, политических, философских, портретных, пейзажных, психологических... Все он неслучайны, уместны, своевременны: за сюжетными ответвлениями, ходами, пересечениями стоят предопределение и авторская воля. Ритм романа, увлекающий читателя, сверен с пульсом живой истории: он то заторможен, как реформаторская деятельность Сперанского; то стремителен, как комета 1812 года; то спокоен, как Кутузов в Филях; то методичен, как народная дубина; то необратим, как бегство французов по Смоленской дороге...
    Все эти картины, сплетаясь, образуют самое знаменитое в мире произведение классической русской литературы - "Война и мир" остается наиболее издаваемым романом во всех странах.`,
    authors: [authors.TOLSTOY],
    publicationYear: 2009,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const WAR_PIECE_2021: AbstractBook = {
    id: 9,
    name: "Война и мир (в 2-х книгах) (комплект)",
    description: `Роман Льва Николаевича Толстого «Война и мир»— книга на все времена. Кажется, что она существовала всегда, настолько знакомым кажется текст, едва мы открываем первые страницы романа, настолько памятны многие его эпизоды: охота и святки, первый бал Наташи Ростовой, лунная ночь в Отрадном, князь Андрей в сражении при Аустерлице... Сцены «мирной», семейной жизни сменяются картинами, имеющими значение для хода всей мировой истории, но для Толстого они равноценны, связаны в едином потоке времени. Каждый эпизод важен не только для развития сюжета, но и как одно из бесчисленных проявлений жизни, которая насыщена в каждом своем моменте и которую учит любить Толстой.
    В данном издании впервые в России воспроизводится полный комплект иллюстраций к роману «Война и мир», созданных выдающимся чешским художником Станиславом Гудечеком (1872–1947) и не переиздававшихся долгие десятилетия.`,
    authors: [authors.TOLSTOY],
    publicationYear: 2021,
    publishingHouse: publishers.AZBUKA,
    category: categories.IMAGINATIVE,
};

export const ANNA_KARENINA_2013: AbstractBook = {
    id: 10,
    name: "Анна Каренина",
    description: `"Анну Каренину" Толстой называл "романом широким и свободным". В основе этого определения - пушкинский термин "свободный роман". Не фабульная завершенность положений, а творческая концепция определяет выбор материала и открывает простор для развития сюжетных линий. Роман "широкого дыхания" привлекал Толстого тем, что в "просторную, вместительную раму" без напряжения входило все то новое, необычайное и нужное, что он хотел сказать людям.`,
    authors: [authors.TOLSTOY],
    publicationYear: 2013,
    publishingHouse: publishers.EKSMO,
    category: categories.IMAGINATIVE,
};

export const ANNA_KARENINA_2008: AbstractBook = {
    id: 15,
    name: "Анна Каренина",
    description: `Вниманию читателей предлагается роман известного русского писателя Л.Н.Толстого "Анна Каренина".
    Величайшая история любви всех времен и народов. История, не сходящая со сценических подмостков, экранизированная бессчетное количество раз - и до сих пор не утратившая беспредельного обаяния страсти - страсти губительной, разрушительной, слепой - но тем более завораживающей своим величием...`,
    authors: [authors.TOLSTOY],
    publicationYear: 2008,
    publishingHouse: publishers.EKSMO,
    category: categories.IMAGINATIVE,
};

export const ANNA_KARENINA_2014: AbstractBook = {
    id: 12,
    name: "Анна Каренина",
    description: `
    "Анну Каренину" по праву называют самым известным и популярным в мире романом о любви.
    "Огромная разработка души человеческой", как отзывался о книге Достоевский, — вот, наверное, что больше всего подкупает нас в этой книге.
    История всепоглощающей страсти, история замужней женщины, полюбившей красавца офицера и бросившей своего мужа наперекор всему: мнению света, общепринятой морали, своей совести.
    "Анну Каренину" экранизировали 30 раз, музыку к балету писали Чайковский и Родион Щедрин, главную героиню в кино играли Грета Гарбо и Вивьен Ли, Алла Тарасова и Татьяна Самойлова, Софи Марсо и Кира Найтли.
    Эта книга, конечно, гораздо больше, чем просто роман о любви, это целая наука о семье, об обществе и о жизни.`,
    authors: [authors.TOLSTOY],
    publicationYear: 2014,
    publishingHouse: publishers.AZBUKA,
    category: categories.IMAGINATIVE,
};

// FIXME: abstract_abstract_book?

export const CRIME_PUNISHMENT_2015: AbstractBook = {
    id: 13,
    name: "Преступление и наказание",
    description: `"Преступление и наказание" — роман об одном преступлении. Двойное убийство, совершенное бедным студентом из-за денег. Трудно найти фабулу проще, но интеллектуальное и душевное потрясение, которое производит роман, — неизгладимо. В чем здесь загадка? Кроме простого и очевидного ответа — "в гениальности Достоевского" — возможно, существует как минимум еще один: "проклятые" вопросы не имеют простых и положительных ответов. Нищета, собственные страдания и страдания близких всегда ставили и будут ставить человека перед выбором: имею ли я право преступить любой нравственный закон, чтобы потом стать спасителем униженных и утешителем слабых; должен ли я сперва возлюбить себя, а только потом, став сильным, возлюбить ближнего своего? Это вечные вопросы.`,
    authors: [authors.DOSTOEVSKY],
    publicationYear: 2015,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const CRIME_PUNISHMENT_2020: AbstractBook = {
    id: 29,
    name: "Преступление и наказание",
    description: `Одно из «краеугольных» произведений русской и мировой литературы, включенный во все школьные и университетские программы, неоднократно экранизированный роман Достоевского «Преступление и наказание» ставит перед читателем важнейшие нравственно-мировоззренческие вопросы — о вере, совести, грехе и об искуплении через страдание. Опровержение преступной «идеи-страсти», «безобразной мечты», завладевшей умом Родиона Раскольникова в самом «умышленном» и «фантастическом» городе на свете, составляет основное содержание этой сложнейшей, соединившей в себе несколько различных жанров книги. Задуманный как «психологический отчет одного преступления», роман Достоевского предстал перед читателем грандиозным художественно-философским исследованием человеческой природы, христианской трагедией о смерти и воскресении души.`,
    authors: [authors.DOSTOEVSKY],
    publicationYear: 2020,
    publishingHouse: publishers.AZBUKA,
    category: categories.IMAGINATIVE,
};

export const CRIME_PUNISHMENT_2012: AbstractBook = {
    id: 11,
    name: "Преступление и наказание",
    description: `
    "Преступление и наказание" Федора Михайловича Достоевского принадлежит к числу величайших произведений мировой литературы. Задумывая роман, писатель обозначил его главную идею как "психологический отчет одного преступления", совершенного под влиянием новых идей. Самоутверждение личности, стремление к власти над обстоятельствами и людьми, право на эгоизм - таковы были умонастроения в обществе, тонко и глубоко осмысленные Достоевским. Недаром великий философ Фридрих Ницше признавался, что многим обязан русскому мыслителю. "Преступление и наказание" - это книга, в которой детективная интрига уступает место истории падения и воскрешения человеческой души, истории освобождения от кругов ада и торжества высшей правды и любви. Роман выдержал множество экранизаций, из которых самыми известными являются фильм Льва Кулиджанова с Георгием Тараторкиным в роли Родиона Раскольникова и французская лента с Жаном Габеном и Мариной Влади.`,
    authors: [authors.DOSTOEVSKY],
    publicationYear: 2012,
    publishingHouse: publishers.LENIZDAT,
    category: categories.IMAGINATIVE,
};

export const IDIOT_2015: AbstractBook = {
    id: 16,
    name: "ИДИОТ",
    description: `Величайший роман Достоевского.
    "Идиота" экранизировали 13 раз лучшие постановщики от Индии до Германии — Жорж Лампен и Анджей Жулавский, Акира Куросава и Анджей Вайда, отечественные Пырьев и Бортко.
    Завораживающая история трагических страстей, связавших купца Парфена Рогожина, бывшую содержанку богатого дворянина Настасью Филипповну и "идеального человека" князя Мышкина — беспомощного идиота в мире корысти и зла, гласящая о том, что сострадание, возможно, единственный закон человеческого бытия. Она по-прежнему актуальна и воспринимается ярко и непосредственно, будто была написана вчера.`,
    authors: [authors.DOSTOEVSKY],
    publicationYear: 2015,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const BESY_2015: AbstractBook = {
    id: 17,
    name: "Бесы",
    description: `"Бесы" — наверное, самый пророческий роман Достоевского. Изначально задуманный как острополитическая вещь, основанная на впечатлениях писателя от "нечаевского процесса": группу революционеров судили за убийство студента, решившего выйти из их кружка, — роман далеко перерос просто произведение "на злобу дня".
    На глазах у читателей разворачивается настоящая драма: в центре повествования — группа нигилистов во главе с Петром Верховенским, планирующая поднять смуту по всей России. У главного же героя романа Николая Ставрогина — своя тайна, свой страшный грех и своя большая беда: он совершенно опустошен, и жизнь уже не представляет для него никакого интереса. События в романе проносятся вихрем перед читателем, запутываются в какой-то чудовищный клубок и в результате разрешаются трагедией.
    Настоящее в романе Достоевского тесно связано с прошлым: он видит истоки нигилистических настроений у детей в их отцах-идеалистах, совершенно не знающих России. Но уникальность "Бесов" еще и в том, что на примере этих персонажей Достоевский живописует всю Россию, одержимую бесами, — вчера, сегодня, завтра безумие преследует нас.
    `,
    authors: [authors.DOSTOEVSKY],
    publicationYear: 2015,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const KARAMAZOVS_BROTHERS_2015: AbstractBook = {
    id: 18,
    name: "Братья Карамазовы",
    description: `"Братья Карамазовы" — итог творчества писателя, самое сложное, многоуровневое и неоднозначное произведение Ф.М.Достоевского.
    В гениальном романе, полном страстей, страданий и любви, читатель, по словам H.A.Бердяева, познает "Россию в ее прошлом, настоящем и будущем..."`,
    authors: [authors.DOSTOEVSKY],
    publicationYear: 2015,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const CLEAN_CODE_2019: AbstractBook = {
    id: 19,
    name: "Чистый код. Создание, анализ и рефакторинг",
    description: `Даже плохой программный код может работать. Однако если код не является "чистым", это всегда будет мешать развитию проекта и компании-разработчика, отнимая значительные ресурсы на его поддержку и "укрощение".
    Эта книга посвящена хорошему программированию. Она полна реальных примеров кода. Мы будем рассматривать код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Прочитав книгу, вы узнаете много нового о коде. Более того, вы научитесь отличать хороший код от плохого. Вы узнаете, как писать хороший код и как преобразовать плохой код в хороший.
    Книга состоит из трех частей. В первой части излагаются принципы, паттерны и приемы написания чистого кода; приводится большой объем примеров кода. Вторая часть состоит из практических сценариев нарастающей сложности. Каждый сценарий представляет собой упражнение по чистке кода или преобразованию проблемного кода в код с меньшим количеством проблем. Третья часть книги - концентрированное выражение ее сути. Она состоит из одной главы с перечнем эвристических правил и "запахов кода", собранных во время анализа. Эта часть представляет собой базу знаний, описывающую наш путь мышления в процессе чтения, написания и чистки кода.`,
    authors: [authors.BOB_MARTIN],
    publicationYear: 2019,
    publishingHouse: publishers.PITER,
    category: categories.NOT_IMAGINATIVE,
};

export const PERFECT_PROGRAMMER_2021: AbstractBook = {
    id: 28,
    name: "Идеальный программист. Как стать профессионалом разработки ПО",
    description: `Всех программистов, которые добиваются успеха в мире разработки ПО, отличает один общий признак: они больше всего заботятся о качестве создаваемого программного обеспечения. Это - основа для них. Потому что они являются профессионалами своего дела. В этой книге легендарный эксперт Роберт Мартин (более известный в сообществе как "Дядюшка Боб"), автор бестселлера "Чистый код", рассказывает о том, что значит "быть профессиональным программистом", описывая методы, инструменты и практики разработки "идеального ПО". Книга насыщена практическими советами в отношении всех аспектов программирования: от оценки проекта и написания кода до рефакторинга и тестирования. Эта книга - больше, чем описание методов, она о профессиональном подходе к процессу разработки.`,
    authors: [authors.BOB_MARTIN],
    publicationYear: 2021,
    publishingHouse: publishers.PITER,
    category: categories.NOT_IMAGINATIVE,
};

export const BLOOD_PIXELS_2018: AbstractBook = {
    id: 21,
    name: "Кровь, пот и пиксели. Обратная сторона индустрии видеоигр. 2-е издание",
    description: `Почему Diablo III чуть не стала крупнейшим провалом Blizzard? Как Halo превратилась в стратегию? Через что прошла студия, создавшая Uncharted? Все, что вы хотели знать о разработке Witcher 3 и Destiny, а также многие другие эксклюзивные истории, рассказанные автору этой книги теми, кто создавал самые популярные игры последнего десятилетия. Узнайте, почему игровая индустрия — это не только престиж и огромные зарплаты, но и проверка на стрессоустойчивость и выносливость, которую проходят далеко не все.
    Бестселлер Amazon и национальный бестселлер в США.`,
    authors: [authors.SCHREIER],
    publicationYear: 2018,
    publishingHouse: publishers.BOMBORA,
    category: categories.BUSINESS,
};

export const WRITE_CUT_2020: AbstractBook = {
    id: 22,
    name: "Пиши, сокращай. Как создавать сильный текст",
    description: `Цитата

    "На какое из писем человек скорее ответит? В каком ему проще разобраться? Какое лучше побуждает к действию? Текст может показаться не самой важной частью нашей жизни - особенно если вы не профессиональный писатель. Но от того, как мы формулируем мысли на письме, зависит очень многое: понимают нас или нет, прислушиваются ли к нам, делают ли другие то, что нам нужно, и что они о нас думают. Мы формулируем свои мысли в письмах, объявлениях, статьях, презентациях, и везде о нас судят по тексту."
    
    
    
    О чем книга
    
    Авторы на конкретных примерах показывают, что такое хорошо и что такое плохо в информационных, рекламных, журналистских и публицистических текстах. Как писать письма, на которые будут отвечать, и рассылки, от которых не будут отписываться. Как создавать действенные и не вульгарные рекламные объявления. Как излагать мысли кратко, ясно и убедительно: без языкового мусора, фальши и штампов. Следуя рекомендациям в книге, вы научитесь писать понятно, увлекать читателей и добиваться доверия. Это обязательная книга для копирайтеров, авторов и редакторов, а также дизайнеров, программистов, менеджеров, предпринимателей, руководителей, служащих и всех, кто использует текст в работе.`,
    authors: [authors.MAX_ILYAHOV, authors.LUDMILA_SARYCHEVA],
    publicationYear: 2020,
    publishingHouse: publishers.ALPINA_PUB,
    category: categories.NOT_IMAGINATIVE,
};

export const RISKING_SKIN_2021: AbstractBook = {
    id: 23,
    name: "Рискуя собственной шкурой. Скрытая асимметрия повседневной жизни",
    description: `В своей новой, резко провокационной и одновременно предельно прагматичной книге неподражаемый Николас Нассим Талеб рассказывает, как важно идентифицировать и фильтровать чушь, отличать теорию от практики, поверхностную компетентность от настоящей. Вы узнаете, что такое рациональность в сложных системах и реальном мире, симметрия и асимметрия и в чем состоит логика принятия рисков. Наполняя новым смыслом привычные понятия, такие как «справедливое общество», «профессиональный успех», «личная ответственность», и не боясь задеть эго признанных кумиров, Талеб развенчивает лицемерные идеи и действия апологетов военного вмешательства, инвесторов рынка ценных бумаг и религиозных проповедников. На примерах Хаммурапи и Иисуса Христа, римских и византийских императоров, Сенеки и Дональда Трампа Талеб показывает, что самое важное качество, объединяющее прославленных героев, беззаветных святых и гениальных бизнесменов, — не переносить риск на других.
    «Я люблю, когда меня удивляют. В соответствии с принципом взаимной выгоды я зову читателя в путешествие, которое понравилось бы мне самому».
    (Нассим Николас Талеб)`,
    authors: [authors.TALEB],
    publicationYear: 2021,
    publishingHouse: publishers.COLIBRI,
    category: categories.BUSINESS,
};

export const REFACTORING_2008: AbstractBook = {
    id: 4,
    name: "Рефакторинг. Улучшение существующего кода",
    description: `Подход к улучшению структурной целостности и производительности существующих программ, называемый рефакторингом, получил развитие благодаря усилиям экспертов в области ООП, написавших эту книгу. Каждый шаг рефакторинга прост. Это может быть перемещение поля из одного класса в другой, вынесение фрагмента кода из метода и превращение его в самостоятельный метод или даже перемещение кода по иерархии классов. Каждый отдельный шаг может показаться элементарным, но совокупный эффект таких малых изменений в состоянии радикально улучшить проект или даже предотвратить распад плохо спроектированной программы.

    Мартин Фаулер с соавторами пролили свет на процесс рефакторинга, описав принципы и лучшие приемы его осуществления, а также указав, где и когда следует начинать углубленное изучение кода с целью его улучшения. Основу книги составляет подробный перечень более 70 методов рефакторинга, для каждого из которых описываются мотивация и техника испытанного на практике преобразования кода с примерами на Java. Рассмотренные в книге методы позволяют поэтапно модифицировать код, внося каждый раз небольшие изменения, благодаря чему снижается риск, связанный с развитием проекта.`,
    authors: [authors.MARTIN_FAULER],
    publicationYear: 2008,
    publishingHouse: publishers.SYM_PLUS,
    category: categories.NOT_IMAGINATIVE,
};

export const N1984_2013: AbstractBook = {
    id: 25,
    name: "1984",
    description: `Своеобразный антипод второй великой антиутопии XX века - "О дивный новый мир" Олдоса Хаксли. Что, в сущности, страшнее: доведенное до абсурда "общество потребления" - или доведенное до абсолюта "общество идеи"?
    По Оруэллу, нет и не может быть ничего ужаснее тотальной несвободы...`,
    authors: [authors.ORWELL],
    publicationYear: 2013,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const BRAVE_NEW_WORLD_2017: AbstractBook = {
    id: 26,
    name: "О дивный новый мир",
    description: `"О дивный новый мир" — культовая антиутопия Олдоса Хаксли, изданная миллионными тиражами по всем умиру. Роман о генетически программируемом "обществе потребления", обществе "всеобщего счастья", в котором разворачивается трагическая история человека, ставшего чужаком в этом мире...`,
    authors: [authors.HUXLEY],
    publicationYear: 2017,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const WITCHER_GE_2020: AbstractBook = {
    id: 27,
    name: "Ведьмак. Подарочное издание",
    description: `Одна из лучших фэнтези-саг за всю историю существования жанра. Оригинальное, масштабное эпическое произведение, одновременно и свободное от влияния извне, и связанное с классической мифологической, легендарной и сказовой традицией. Шедевр не только писательского мастерства Анджея Сапковского, но и переводческого искусства Евгения Павловича Вайсброта. «Сага о Геральте» – в одном томе.
    Бесценный подарок и для поклонника прекрасной фантастики, и для ценителя просто хорошей литературы.
    Перед читателем буквально оживает необычный, прекрасный и жестокий мир литературной легенды, в котором обитают эльфы и гномы, оборотни, вампиры и «низушки»-хоббиты, драконы и монстры, – но прежде всего ЛЮДИ.
    Очень близкие нам, понятные и человечные люди – такие как мастер меча ведьмак Геральт, его друг, беспутный менестрель Лютик, его возлюбленная, прекрасная чародейка Йеннифэр, и приемная дочь – безрассудно отважная юная Цири…
    Содержание сборника Ведьмак: 
    
    Подарочное издание:
    
    Последнее желание
    
    Меч предназначения
    
    Крофь эльфов
    
    Час презрения
    
    Крещение огнем
    
    Башня Ласточки
    
    Владычица Озера`,
    authors: [authors.SAPKOWSKI],
    publicationYear: 2020,
    // FIXME:
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const WITCHER__SWALLOW_TOWER_2016: AbstractBook = {
    id: 20,
    name: "Ведьмак. Башня ласточки",
    description: `Что-то кончается. Надвигается Tedd Deireadh, Час Конца... Это чувствуется в воздухе и в воде, в шелесте трав и в гуле ветров, в крови закатов и в ослепительных сполохах северного сияния на зубчатых остриях вершины величественной черной башни. Места, в которое ведет нелегкий путь пепельноволосую девочку на вороной кобылице — по залитому кровью друзей постоялому двору… по залитому кровью бойцов песку арены… по залитому кровью врагов льду озера Тарн Мира. Ведь дело не в том, что ты терпишь страдания. Дело в том, как ты их терпишь. И во имя чего. Лишь постигший эту истину сможет войти в Tor Zireael. Башню Ласточки.
    Сага А. Сапковского давно занимает почетное место в мировой традиции жанра фэнтези, а Геральт стал культовым персонажем не только в мире литературы, но и в универсуме компьютерных игр. Шестая книга из цикла "Ведьмак" впервые выходит с иллюстрациями Дениса Гордеева, созданными специально для этого издания.`,
    authors: [authors.SAPKOWSKI],
    publicationYear: 2016,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const WITCHER__THUNDER_SEASON_2016: AbstractBook = {
    id: 14,
    name: "Ведьмак. Сезон гроз",
    description: `Свершилось! Через пятнадцать лет после того, как была поставлена финальная точка в последнем томе о приключениях Геральта из Ривии, его создатель дарит всем поклонникам своего таланта еще одну встречу с беловолосым ведьмаком. Встречу неожиданную — и от того еще более волнующую и желанную.
    Чего стоит ведьмак без своих знаменитых мечей и чародейка — без своей магии? Может ли зверь найти в себе человечность, а человек — обуздать живущего в нем зверя? К чему могут привести слабости сильных мира сего? Можно ли вернуться оттуда, откуда нет возврата, если ты очень нужен здесь и сейчас?
    Сага А. Сапковского давно занимает почетное место в мировой традиции жанра фэнтези, а Геральт стал культовым персонажем не только в мире литературы, но и в универсуме компьютерных игр. Восьмая книга из цикла "Ведьмак" впервые выходит с иллюстрациями Дениса Гордеева, созданными специально для этого издания.`,
    authors: [authors.SAPKOWSKI],
    publicationYear: 2016,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const WITCHER__LAST_WISH_2016: AbstractBook = {
    id: 7,
    name: "Ведьмак. Последнее желание",
    description: `Книгой "Последнее желание" начинается один из лучших циклов в истории жанра фэнтези. Семь новелл о ведьмаке Геральте из Ривии, его друзьях и возлюбленных,
    о его нелегкой "работе" по истреблению всякой нечисти, о мире, населенном эльфами, гномами, оборотнями, драконами, и, конечно,
    людьми — со всеми их страстями, пороками и добродетелями.
    Сага А. Сапковского давно занимает почетное место в мировой традиции жанра фэнтези,
    а Геральт стал культовым персонажем не только в мире литературы, но в универсуме компьютерных игр. Аудитория пана Анджея неуклонно расширяется,
    и мы рады содействовать этому, выпустив первую книгу о Ведьмаке с иллюстрациями, созданными специально для этого издания.`,
    authors: [authors.SAPKOWSKI],
    publicationYear: 2016,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const GOT__DANCE_OF_DRAGONS_2019: AbstractBook = {
    id: 31,
    name: "Игра Престолов: Танец с драконами. Грезы и пыль",
    description: `"Война близится к концу, но Вестерос по-прежнему истекает кровью".
    Дополнение для настольной "Игры престолов" добавляет нововведения, которые разительно изменят игровой процесс.
    Внимание! Это не самостоятельная игра. Вам понадобится базовая настольная "Игра престолов. Второе издание".
    
    Ключевые особенности игры:
    1) "Танец с драконами" - дополнение к культовой настольной игре "Игра престолов".
    2) В новом дополнении появляется 42 новые карты Домов. Благодаря новым картам персонажей, таким как Манс Налетчик и Джон Сноу, Квиберн и Квентин Мартелл, Уолдер Фрей и Рамси Болтон, сражения обретут стратегическую глубину.
    3) Динамичный сценарий "Танец с драконами" на 6 опытных игроков, воспроизводит ключевые события последних книг эпопеи "Песнь Льда и Пламени": битву за Винтерфелл, вторжение Железного флота на Простор, осаду Драконьего Камня и многие другие.`,
    authors: [authors.GEORGE_MARTIN],
    publicationYear: 2019,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const GOT__STORM_OF_SWORDS_2018: AbstractBook = {
    id: 2,
    name: "Игра Престолов: Буря мечей",
    description: `Перед вами - третья летопись цикла "Песнь льда и огня". Эпическая, чеканная сага о мире Семи Королевств. О мире суровых земель вечного холода и радостных земель вечного лета. Мире лордов и героев, воинов и магов, чернокнижников и убийц - всех, кого свела воедино Судьба во исполнение древнего пророчества. О мире опасных приключений, великих деяний и тончайших политических интриг.
    Сотрясается в борьбе Железный Трон Семи Королевств. Предают друг друга недавние союзники, злейшими врагами становятся добрые друзья.
    В неприступном замке плетет сети изощренного заговора могущественная чернокнижница...
    В далеких, холодных землях собирает силы юный властитель Севера Робб от Дома Старк...
    Новые и новые воины сходятся под знаменами Даэнерис Бурерож-денной, правящей последними из оставшихся в мире драконов...
    Но ныне в разгорающийся пожар сражений вступают еще и Иные - армия живых мертвецов, коих не остановить ни властью оружия, ни властью магии.
    Буря мечей грядет в Семи Королевствах - и многие падут в этой буре...`,
    authors: [authors.GEORGE_MARTIN],
    publicationYear: 2018,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

export const GOT__FEAST_FOR_CROWS_2012: AbstractBook = {
    id: 33,
    name: "Игра Престолов: Пир стервятников",
    description: `Перед вами - четвертая летопись цикла "Песнь льда и огня". Эпическая, чеканная сага о мире Семи Королевств. О мире суровых земель вечного холода и радостных земель вечного лета. Мире лордов и героев, воинов и магов, чернокнижников и убийц - всех, кого свела воедино Судьба во исполнение древнего пророчества. О мире опасных приключений, великих деяний и тончайших политических интриг.
    Война Пяти Королей наконец завершена, и дом Ланнистер с союзниками празднует победу. Однако до мира и спокойствия еще очень далеко! Властитель Севера Робб от дома Старк сумел подавить мятеж в далеких северных землях, однако его родичи, похоже, слишком слабы, чтобы удержать завоеванные земли... Снова собираются воедино бандиты, ренегаты и уцелевшие повстанцы. Снова угрожает смертельная опасность Железному Трону Семи Королевств - и стервятники уже чуют приближения нового пира...`,
    authors: [authors.GEORGE_MARTIN],
    publicationYear: 2012,
    publishingHouse: publishers.AST,
    category: categories.IMAGINATIVE,
};

/* eslint-enable max-len */

export const getAll = () =>
    [
        FIGHT_CLUB_2014,
        FIGHT_CLUB_2018,
        BLACK_SWAN_2021,
        CHOKE_2006,
        CHOKE_2015,
        WAR_PIECE_2000,
        WAR_PIECE_1945,
        WAR_PIECE_2009,
        WAR_PIECE_2021,
        ANNA_KARENINA_2013,
        ANNA_KARENINA_2008,
        ANNA_KARENINA_2014,
        CRIME_PUNISHMENT_2012,
        CRIME_PUNISHMENT_2015,
        CRIME_PUNISHMENT_2020,
        IDIOT_2015,
        BESY_2015,
        KARAMAZOVS_BROTHERS_2015,
        CLEAN_CODE_2019,
        PERFECT_PROGRAMMER_2021,
        BLOOD_PIXELS_2018,
        WRITE_CUT_2020,
        RISKING_SKIN_2021,
        REFACTORING_2008,
        N1984_2013,
        BRAVE_NEW_WORLD_2017,
        WITCHER_GE_2020,
        WITCHER__SWALLOW_TOWER_2016,
        WITCHER__THUNDER_SEASON_2016,
        WITCHER__LAST_WISH_2016,
        GOT__DANCE_OF_DRAGONS_2019,
        GOT__STORM_OF_SWORDS_2018,
        // Книга, для которой нет владельца и экземпляров
        GOT__FEAST_FOR_CROWS_2012,
    ].sort((a, b) => a.id - b.id);

export const getById = (bookId: number) => {
    return getAll().find((b) => b.id === bookId);
};

export const getByIds = (bookIds: number[]) => {
    return bookIds.map((id) => getById(id)!);
};
export const toString = (entity: AbstractBook) => {
    const author = entity.authors.map(authors.getShortname).join(", ");
    const publisher = publishers.toString(entity.publishingHouse);
    const book = `${entity.name}, ${entity.publicationYear}`;

    return `${author} — ${book} (${publisher})`;
};

export const getShortname = (entity: AbstractBook) => {
    const author = entity.authors.map(authors.getShortname).join(", ");
    const book = `${entity.name}`;

    return `${author} — ${book}`;
};

const SORTING_TYPE = {
    1: "POPULARITY" as const,
    2: "PRICE" as const,
    3: "TIME" as const,
    4: "NOVELTY" as const,
};

type GetListParams = {
    filters: {
        search?: string;
        authors?: number[];
        publishers?: number[];
        categories?: number[];
        prices?: {
            from: number;
            to: number;
        };
        tariff?: number;
        existsOnly?: boolean;
        // !!! FIXME: Ужаснейший код! Никогда не показывайте это бекендерам!
        getRentInfoBy?: (
            book: AbstractBook,
        ) => {
            duration: number;
            status: "OUT_STOCK" | "RENTABLE" | "RESERVABLE" | "OWN";
        };
    };
    orderby?: number;
};

// FIXME: move to shared/api later
// eslint-disable-next-line max-lines-per-function
export const getList = (params: GetListParams) => {
    const { filters, orderby } = params;
    const books = getAll();
    // FIXME: refine search
    // FIXME: simplify format
    const filtered = books
        .filter((book) => {
            if (!filters.search) return true;
            return new RegExp(filters.search, "i").test(toString(book));
        })
        .filter((book) => {
            if (!filters.publishers?.length) return true;
            return filters.publishers.includes(book.publishingHouse.id);
        })
        .filter((book) => {
            if (!filters.authors?.length) return true;
            return book.authors.some((a) => filters.authors?.includes(a.id));
        })
        .filter((book) => {
            if (!filters.categories?.length) return true;
            return filters.categories?.includes(book.category.id);
        })
        .filter((book) => {
            const price = getPrice(book);
            if (!filters.prices) return true;
            return filters.prices.from <= price && price <= filters.prices.to;
        })
        .filter((book) => {
            if (!filters.tariff || !filters.getRentInfoBy) return true;
            const { duration } = filters.getRentInfoBy(book);
            return filters.tariff <= duration;
        })
        .filter((book) => {
            if (!filters.existsOnly || !filters.getRentInfoBy) return true;
            const { status } = filters.getRentInfoBy(book);
            return status === "RENTABLE" || status === "OWN";
        });
    // .filter((book) => {
    //     if (!filters.exclude) return true;
    //     return !filters.exclude.includes(book.id);
    // });

    if (!orderby) return filtered;

    const sorting = SORTING_TYPE[orderby as keyof typeof SORTING_TYPE];

    switch (sorting) {
        case "NOVELTY":
            return filtered.sort((a, b) => b.id - a.id);
        case "POPULARITY":
            return filtered.sort((a, b) => getPopularity(b) - getPopularity(a));
        case "PRICE":
            return filtered.sort((a, b) => getPrice(a) - getPrice(b));
        case "TIME":
            if (filters.getRentInfoBy === undefined) return filtered;

            return filtered.sort(
                (a, b) => filters.getRentInfoBy!(b).duration - filters.getRentInfoBy!(a).duration,
            );
        default:
            return filtered;
    }
};

export const getPrice = (book: AbstractBook) => {
    const fullTitle = toString(book);
    const pseudoFactor = fullTitle.length % 3;
    const factor = pseudoFactor + 2;

    return factor * 50;
};

export const getPopularity = (book: AbstractBook) => {
    if (isPopular(book)) return 5;
    const fullTitle = toString(book);
    const pseudoFactor = fullTitle.length % 5;
    return pseudoFactor;
};

// export const getExtraPrice = (book: AbstractBook) => {
//     return getPrice(book) * COEFF;
// };

export const getPopular = () => [BLACK_SWAN_2021, N1984_2013, RISKING_SKIN_2021, WRITE_CUT_2020];

export const isPopular = (book: AbstractBook) =>
    getPopular()
        .map((it) => it.id)
        .includes(book.id);
